# Taps
tap "github/gh"

# Formulae
brew "asdf"
brew "awscli-local"
brew "bash-completion"
brew "coreutils"
brew "curl"
brew "direnv"
brew "gh"
brew "git"
brew "gnupg"
brew "jq"
brew "kubectx"
brew "mosh"
brew "mr"
brew "neovim"
brew "parallel"
brew "python@3.11"
brew "qemu"
brew "ssh-copy-id"
brew "starship"
brew "telnet"
brew "tree"
brew "watch"
brew "wget"
brew "yq"

# Casks
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "android-platform-tools"
cask "brave-browser", args: { appdir: "/Applications" }
cask "chromedriver", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-hack-nerd-font"
cask "gas-mask", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "handbrake-app", args: { appdir: "/Applications" }
cask "notion-calendar", args: { appdir: "/Applications" }
cask "rectangle"
cask "slack", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "tripmode", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "zoom"
